## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| update   | `module.rds_cluster.aws_rds_cluster.cluster`                                   |
|          | `module.rds_cluster.aws_security_group.rds_proxy`                              |
| recreate | `module.rds_cluster.aws_secretsmanager_secret_version.connection_string`       |
|          | `module.rds_cluster.aws_secretsmanager_secret_version.proxy_connection_string` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.rds_cluster.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
        id                                  = "saas-procurement-database-cluster"
      ~ master_password                     = (sensitive value)
        tags                                = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database-cluster"
            "Terraform"  = "true"
        }
        # (44 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds_cluster.aws_secretsmanager_secret_version.connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-XBgmJc" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-XBgmJc|47124D86-9DB1-4FA2-8D7D-1142D82AF173" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "47124D86-9DB1-4FA2-8D7D-1142D82AF173" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds_cluster.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-proxy-connection-string-fWs71m" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-proxy-connection-string-fWs71m|1E702360-9D77-4E82-AD05-546A27F7C4AF" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "1E702360-9D77-4E82-AD05-546A27F7C4AF" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds_cluster.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
        id                     = "sg-051638cd60aef88c3"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow RDS cluster to receive requests from ECS"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d1ca7e7e561a219f",
                ]
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
        ]
        name                   = "saas-procurement-database_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
